app/views/static_pages/index.html.erb

SELECT  "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
      <%= link_to 'Dashboard', dashboard_path, class: "btn btn-lg btn-primary" %>
    <% elsif Presentation.first == nil && Teacher.first == nil && Student.first == nil %>