app/views/admins/dashboard.html.erb

SELECT  "presentations".* FROM "presentations" ORDER BY "presentations"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "teachers".* FROM "teachers" ORDER BY "teachers"."id" ASC LIMIT ?  [["LIMIT", 1]]
---

          <% if Presentation.first == nil && Teacher.first == nil && Student.first == nil %>