app/helpers/sessions_helper.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def current_admin
    if session[:admin_id]
      @current_admin ||= Admin.find_by(id: session[:admin_id])