app/controllers/admins_controller.rb

SELECT "teachers".* FROM "teachers"
---
  def list_teac
    @teachers = Teacher.all

SELECT  "teachers".* FROM "teachers" ORDER BY "teachers"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def view_teac
    @teac = Teacher.first

SELECT "students".* FROM "students"
---
  def list_stud
    @students = Student.all

SELECT "presentations".* FROM "presentations"
---
  def list_pres
    @presentations = Presentation.all

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 1]]
---
  def clear
    [Student, Admin, Presentation, Teacher].each { |model| model.truncate! }

INSERT INTO "admins" ("handle", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["handle", "s9362"], ["password_digest", "$2a$10$SzTrhdf1YkfULEzVZfj2LuGZZzkMvr1a5wtM3jeW/Mue2.FHZJqn6"], ["created_at", "2019-01-31 13:46:11.005217"], ["updated_at", "2019-01-31 13:46:11.005217"]]
---
  def create
    @admin = Admin.new(admin_params)
    if @admin.save

INSERT INTO "teachers" ("vorname", "name", "number", "mail", "nv", "vn", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def new_teac
    @teacher = Teacher.new(teac_params)
    @teacher.nv = "#{@teacher.name} #{@teacher.vorname}"
    @teacher.vn = "#{@teacher.vorname} #{@teacher.name}"
    if @teacher.save

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 1]]
---
  def destroy
    @admin.destroy

SELECT "teachers".* FROM "teachers"
---
  def import_teachers

    items = []
    CSV.foreach(params[:file].path,headers: true, col_sep: ";") do |row|
      items << Teacher.new(row.to_h)
    end
    Teacher.import(items)

    t = Teacher.all