app/controllers/admins_controller.rb

SELECT  "presentations".* FROM "presentations" ORDER BY "presentations"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "teachers".* FROM "teachers" ORDER BY "teachers"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def dashboard
    if Student.first == nil && Presentation.first == nil && Teacher.first == nil

SELECT  "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def prefs_upd
    r = params[:req]
    f = params[:free]
    t = params[:time].to_i * 60
    d = params[:pres_date]
    if Student.all.count * r.to_i > Presentation.all.count * f.to_i

SELECT "teachers".* FROM "teachers"
---
  def processor
    Teacher.all.each do |t|