app/controllers/sessions_controller.rb

  def create
    admin = Admin.find_by_handle(params[:handle])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."handle" = ? LIMIT ?  [["handle", "a1"], ["LIMIT", 1]]