app/controllers/students_controller.rb

SELECT "students".* FROM "students" ORDER BY name asc
---
  def index
    @students = Student.order("#{sort_column} #{sort_direction}")